### defining data

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [2]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

#### Statement 1

In [3]:
flight_null=np.where(df['FlightNumber'].isnull() == True)

In [4]:
for val in flight_null:
    df["FlightNumber"][val]=df["FlightNumber"][val-1] + 10

C:\Users\Jana\AppData\Local\Temp/ipykernel_4952/402374169.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["FlightNumber"][val]=df["FlightNumber"][val-1] + 10

In [5]:
df["FlightNumber"]=df["FlightNumber"].astype("int64")
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

#### Statement 2

In [6]:
df1=df["From_To"].str.split("_",expand=True)
df1.columns=["From","To"]
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [7]:
df.drop('From_To',axis=1,inplace=True)

In [8]:
df=pd.concat([df1,df],axis=1)

In [9]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris         10045      [23, 47]               KLM(!)
1    MAdrid      miLAN         10055            []    <Air France> (12)
2    londON  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

#### Statement 3

In [10]:
df["From"]=df["From"].str.title()

In [11]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      paris         10045      [23, 47]               KLM(!)
1    Madrid      miLAN         10055            []    <Air France> (12)
2    London  StockhOlm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis         10075          [13]       12. Air France
4  Brussels     londOn         10085      [67, 32]          "Swiss Air"

### Statement 5

In [12]:
df2=pd.DataFrame(df["RecentDelays"].to_list())

In [13]:
df2.columns
df2

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [14]:
df2.columns=[f"RecentDelays{x+1}" for x in df2.columns]

In [15]:
df2

   RecentDelays1  RecentDelays2  RecentDelays3
0           23.0           47.0            NaN
1            NaN            NaN            NaN
2           24.0           43.0           87.0
3           13.0            NaN            NaN
4           67.0           32.0            NaN

In [16]:
df.drop("RecentDelays",axis=1,inplace=True)

In [17]:
df=pd.concat([df,df2],axis=1)

In [18]:
df

,From,To,FlightNumber,Airline,RecentDelays1,RecentDelays2,RecentDelays3
0,London,paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,miLAN,10055,<Air France> (12),NaN,NaN,NaN
2,London,StockhOlm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,PaRis,10075,12. Air France,13.0,NaN,NaN
4,Brussels,londOn,10085,"""Swiss Air""",67.0,32.0,NaN